Revit 2025 API
ElectricalPhaseConfiguration Enumeration
An enumerated type to specify the electrical phase configuration.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ElectricalPhaseConfiguration
Public Enumeration ElectricalPhaseConfiguration
public enum class ElectricalPhaseConfiguration
type ElectricalPhaseConfiguration
Members
Member name | Value | Description
Undefined | 0 | Electrical phase configuration is undefined.
Wye | 1 | Electrical phase configuration is Y.
Delta | 2 | Electrical phase configuration is delta.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace